Repository: WPPlugins/cpt-contact-form
Catalog: lang/cpt-contact-form-*.po
Languages: el

source: Save Changes
el: Αποθήκευση Αλλαγών

source: Only if there are new unread messages
el: Μόνο αν υπάρχουν νέα αδιάβαστα μηνύματα

source: minutes
el: λεπτά

source: Send a notification e-mail every
el: Αποστολή ειδοποίησης με e-mail κάθε

source: Notifications
el: Ειδοποιήσεις

source: seconds
el: δευτερόλεπτα

source: for more than
el: για περισσότερο από

source: Implicitly, by viewing/editing
el: Έμμεσα, στην Προβολή/Επεξεργασία

source: Explicitly, from the edit screen
el: Ρητά, από την οθόνη επεξεργασίας

source: Mark message as "read"
el: Σημείωση μηνύματος ως "αναγνωσμένο"

source: CPT Contact Form Notification
el: Ειδοποίηση CPT Contact Form

source: CPT Contact Form Notification Interval
el: Διάστημα μεταξύ Ειδοποιήσεων CPT Contact Form

source: CPT Contact Form Options
el: Επιλογές CPT Contact Form

source: Read
el: Αναγνωσμένο

source: Unread
el: Μη Αναγνωσμένο

source: Status
el: Κατάσταση

source: Mark as Read
el: Σημείωση ως Αναγνωσμένο

source: There's a new contact message for you.
el: Σας εχει αποσταλεί ένα νέο μήνυμα μέσω της φόρμας επικοινωνίας.

source: From
el: Από

source: Submit
el: Αποστολή

source: Message
el: Μήνυμα

source: Subject
el: Θέμα

source: Your e-mail
el: Το e-mail σας

source: Your Name
el: Το όνομά σας

source: All fields are mandatory!
el: Όλα τα πεδία είναι υποχρεωτικά!

source: Your message has been sent. Thank you for your communication.
el: Το μήνυμά σας έχει σταλεί. Ευχαριστούμε για την επικοινωνία.

source: Messages from the Contact Form
el: Μηνύματα από τη Φόρμα Επικοινωνίας

source: No Contact Messages Found in Trash
el: Δεν βρέθηκαν Μηνύματα στον Κάδο

source: No Contact Messages Found
el: Δεν βρέθηκαν Μηνύματα

source: Search Contact Messages
el: Αναζήτηση στα Μηνύματα

source: View Contact Message
el: Προβολή Μηνύματος

source: Edit Contact Message
el: Επεξεργασία Μηνύματος

source: Add new Contact Message
el: Προσθήκη Νέου Μηνύματος

source: New Contact Message
el: Νέο Μήνυμα

source: All Contact Messages
el: Όλα τα Μηνύματα

source: Contact Message
el: Μήνυμα Φόρμας Επικοινωνίας

source: Contact Messages
el: Μηνύματα Φόρμας Επικοινωνίας
